result/result_probably_consolidated/2core_4iothread/sm110(icelake)_consolidated_2core_8iothread/multiplier_4/run6.txt
# run=6/10
# 2026-04-07T23:47:01-05:00
# cmd: taskset -c 1-31 sysbench oltp_read_write --mysql-db=sbtest --tables=1 --table_size=100 --threads=32 --time=60 --rand-type=pareto run

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            748104
        write:                           194129
        other:                           99720
        total:                           1041953
    transactions:                        46284  (770.53 per sec.)
    queries:                             1041953 (17346.28 per sec.)
    ignored errors:                      7152   (119.07 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      770.5292
    time elapsed:                        60.0678s
    total number of events:              46284

Latency (ms):
         min:                                    2.10
         avg:                                   41.50
         max:                                  230.66
         95th percentile:                       87.56
         sum:                              1920662.56

Threads fairness:
    events (avg/stddev):           1446.3750/20.62
    execution time (avg/stddev):   60.0207/0.02